In [10]:
import sklearn
import numpy as np
import pandas as pd
import seaborn as sns

In [5]:
print(sklearn.__version__)

1.8.0

In [8]:
# data = pd.DataFrame({
#     "age": [25, 30, None, 45, 50],
#     "salary": [50000, 60000, 55000, None, 90000],
#     "department": ["HR", "IT", "Finance", "IT", "HR"],
#     "target": [0, 1, 0, 1, 1]
# })

In [11]:
data=sns.load_dataset('titanic')

In [ ]:
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import *

In [13]:
data.sample(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
112,0,3,male,22.0,0,0,8.05,S,Third,man,True,NaN,Southampton,no,True
27,0,1,male,19.0,3,2,263.00,S,First,man,True,C,Southampton,no,False
250,0,3,male,NaN,0,0,7.25,S,Third,man,True,NaN,Southampton,no,True
763,1,1,female,36.0,1,2,120.00,S,First,woman,False,B,Southampton,yes,False
221,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [ ]:
si=SimpleImputer(strategy='mean')
data['age']=si.fit_transform(data[['age']])

In [15]:
data.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [16]:
si1=SimpleImputer(strategy='most_frequent')
data[['embarked','deck','embark_town']]=si1.fit_transform(data[['embarked','deck','embark_town']])
data.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [17]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True

In [18]:
print(data)

     survived  pclass     sex        age  sibsp  parch     fare embarked  \
0           0       3    male  22.000000      1      0   7.2500        S
1           1       1  female  38.000000      1      0  71.2833        C
2           1       3  female  26.000000      0      0   7.9250        S
3           1       1  female  35.000000      1      0  53.1000        S
4           0       3    male  35.000000      0      0   8.0500        S
..        ...     ...     ...        ...    ...    ...      ...      ...
886         0       2    male  27.000000      0      0  13.0000        S
887         1       1  female  19.000000      0      0  30.0000        S
888         0       3  female  29.699118      1      2  23.4500        S
889         1       1    male  26.000000      0      0  30.0000        C
890         0       3    male  32.000000      0      0   7.7500        Q

      class    who  adult_male deck  embark_town alive  alone
0     Third    man        True    C  Southampton    no  False
1     First  woman       False    C    Cherbourg   yes  False
2     Third  woman       False    C  Southampton   yes   True
3     First  woman       False    C  Southampton   yes  False
4     Third    man        True    C  Southampton    no   True
..      ...    ...         ...  ...          ...   ...    ...
886  Second    man        True    C  Southampton    no   True
887   First  woman       False    B  Southampton   yes   True
888   Third  woman       False    C  Southampton    no  False
889   First    man        True    C    Cherbourg   yes   True
890   Third    man        True    C   Queenstown    no   True

[891 rows x 15 columns]